In [1]:
# Import Packages
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [4]:
# Load CSV file
data = pd.read_csv('testfile.csv')

In [6]:
data

   q  r  s  t   apple
0  2  3  4  5    pear
1  a  s  d  f  rabbit
2  5  2  5  7     dog

In [7]:
# No Header in dataframe
data = pd.read_csv('testfile.csv', header=None)

In [8]:
data

   0  1  2  3       4
0  q  r  s  t   apple
1  2  3  4  5    pear
2  a  s  d  f  rabbit
3  5  2  5  7     dog

In [9]:
# Load Data using read_table()
data = pd.read_table('testfile.csv', sep=',', header=None)

In [10]:
data

   0  1  2  3       4
0  q  r  s  t   apple
1  2  3  4  5    pear
2  a  s  d  f  rabbit
3  5  2  5  7     dog

In [11]:
# To load specific number of rows only
pd.read_csv('testfile.csv', header=None, nrows=2)

   0  1  2  3      4
0  q  r  s  t  apple
1  2  3  4  5   pear

In [12]:
# Exporting Data File
data.to_csv('Exported_testfile_.csv')

In [13]:
# Replacing delimeter with desired notations
import sys

In [14]:
data.to_csv(sys.stdout)

,0,1,2,3,4
0,q,r,s,t,apple
1,2,3,4,5,pear
2,a,s,d,f,rabbit
3,5,2,5,7,dog

In [15]:
data.to_csv(sys.stdout, sep='_')

_0_1_2_3_4
0_q_r_s_t_apple
1_2_3_4_5_pear
2_a_s_d_f_rabbit
3_5_2_5_7_dog

In [28]:
data.to_csv(sys.stdout, sep='|')

|0|1|2|3|4
0|q|r|s|t|apple
1|2|3|4|5|pear
2|a|s|d|f|rabbit
3|5|2|5|7|dog

In [31]:
data.to_csv(sys.stdout, columns=[0,1,2])

,0,1,2
0,q,r,s
1,2,3,4
2,a,s,d
3,5,2,5

### Practice Part

In [32]:
df = pd.read_csv('testfile.csv')

In [33]:
df

   q  r  s  t   apple
0  2  3  4  5    pear
1  a  s  d  f  rabbit
2  5  2  5  7     dog

In [34]:
df.head(2)

   q  r  s  t   apple
0  2  3  4  5    pear
1  a  s  d  f  rabbit

In [35]:
df = pd.read_csv('testfile.csv', header=None)

In [36]:
df

   0  1  2  3       4
0  q  r  s  t   apple
1  2  3  4  5    pear
2  a  s  d  f  rabbit
3  5  2  5  7     dog

In [37]:
dftxt = pd.read_csv('testfile.txt')

In [38]:
dftxt

   q  r  s  t   apple
0  2  3  4  5    pear
1  a  s  d  f  rabbit
2  5  2  5  7     dog

In [39]:
dftxt = pd.read_csv('testfile.txt', header=None)

In [40]:
dftxt

   0  1  2  3       4
0  q  r  s  t   apple
1  2  3  4  5    pear
2  a  s  d  f  rabbit
3  5  2  5  7     dog

In [45]:
dftble = pd.read_table('testfile.csv', sep=',', header=None)

In [46]:
dftble

   0  1  2  3       4
0  q  r  s  t   apple
1  2  3  4  5    pear
2  a  s  d  f  rabbit
3  5  2  5  7     dog

In [48]:
dftble.to_excel('test.xlsx')

In [49]:
dftxt.to_csv('test1.csv')